[
    {
        "page": 1,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "page": 0,
            "total_pages": 4,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114192009+05'30'",
            "modDate": "D:20241114192009+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nFinancial modeling and BI reporting\n1\n• Developed budget planning tools and short-term forecast models for various \nbusiness units to be able to test multiple scenarios before preparing the budget \nand adjust business strategy based on near-term forecast. \n• Designed fully automated dashboards to provide a comprehensive view of the \nfinancials and a detailed view of all accounts to monitor performance and \nsignificantly reduce the manual effort.\nSaaS based value stream management company\nBack to summary page\n"
    },
    {
        "page": 2,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "page": 1,
            "total_pages": 4,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114192009+05'30'",
            "modDate": "D:20241114192009+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nPicture this…\nYou’re looking for centralized FP&A models for budgeting, cash flows, and general review of performance across the company \ngiven that you have recently expanded inorganically\nSaaS company needs financial modeling and integrated BI \nreporting\n2\nYour value is enhanced. \n•\nBudget Planning tools gave you the flexibility to test multiple scenarios before preparing the budget and enabled to track \nvariance on an ongoing basis and course correct real-time\n•\nThe short-term cashflow model helped you compare near-term forecast against overall business plan and adjust business \nstrategy based on outlook, especially during the Covid-19 crisis\n•\nYou have automated Monthly Operating Review and Account Performance dashboards enabling quick access to KPIs, \nsignificantly reducing the manual effort in generating monthly reports, and facilitating easy integration of new acquisitions\nFINANCIAL MODELING AND BI \nREPORTING\nKEY RESULT   \n•\nImpact 1…\n•\nImpact 2…\nVALUE LEVERS PULLED\n•\nBudget Scenario \nPlanning tool \n•\nCashflow forecasting \nmodel \n•\nExecutive reporting \nsuite\n2\nYou turn to Accordion. \nWe partner with your team to develop budget planning tools and short-term forecast models for various business units, \nincluding: \n1)\nDeveloping an integrated Budget Scenario Planning tool that allowed to input ‘growth ratios’ for setting budgets, \nfacilitating variance analysis between new and planned budgets, and integrated into a BI dashboard to drive executive \nlevel decision making\n2) Building a centralized 13-week cashflow forecasting model through seamless integration of Cashflow inputs from \ndisparate systems of all subsidiaries accounting for their unique cash inflow and outflow characteristics, and flexibility \nto tweak the forecasts delivered at both subsidiary and corporate levels.\n3) Deploying a comprehensive executive reporting suite, focusing on the Monthly Operating Review that provides a \nsummary product P&L and key balance sheet & cashflow metrics, along account growth, customer health/risk and \nopportunity win/loss trends\n"
    },
    {
        "page": 3,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "page": 2,
            "total_pages": 4,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114192009+05'30'",
            "modDate": "D:20241114192009+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nAccordion Value Add \n•\nDeveloped an integrated Budget Scenario Planning tool that allowed to input ‘growth ratios’ for setting budgets, facilitated variance \nanalysis between new and planned budgets, and integrated into a BI dashboard to drive executive level decision making\n•\nBuilt a centralized 13-week Cashflow forecasting model through seamless integration of Cashflow inputs from disparate systems of all \nsubsidiaries accounting for their unique cash inflow and outflow characteristics, and flexibility to tweak the forecasts delivered at both \nsubsidiary and Corporate levels.\n•\nDeployed a comprehensive executive reporting suite, focused on the Monthly Operating Review that provides a summary product P&L and \nkey Balance Sheet & Cashflow metrics, along Account Growth, Customer Health/Risk and Opportunity Win/Loss Trends\nSituation\n•\nClient recently expanded inorganically, resulting in a need for centralized FP&A models for budgeting, cash flows, and general review of \nperformance across the company\n•\nPartnered with the client to build a consolidated Budget Planning Tool, Cash Flow forecasting Model, Monthly Operating Review and \nAccount Performance Dashboards\nBI infrastructure design & implementation for a SaaS company \n3\nImpact\n•\nBudget Planning tools gave users the flexibility to test multiple scenarios before preparing the budget and enabled them to track variance \non an ongoing basis and course correct real-time\n•\nThe short-term cashflow model helped compare near-term forecast against overall business plan and adjust business strategy based on \noutlook, especially during the Covid-19 crisis\n•\nAutomated Monthly Operating Review and Account Performance dashboards enabled quick access to KPIs, significantly reducing the \nmanual effort in generating monthly reports, and facilitated easy integration of new acquisitions\nFINANCIAL MODELING AND BI \nREPORTING\n"
    },
    {
        "page": 4,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (49).pdf",
            "page": 3,
            "total_pages": 4,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114192009+05'30'",
            "modDate": "D:20241114192009+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nSummary of FP&A tools built\n4\n01\nMonthly operating \nreview model\n02\nBudget scenario \nplanning tool\nScenario analysis tool was customized to allow users to define multiple scenarios \nwithin the model and study the impact on planned budgets. \nThe tool also facilitates reporting and visualization of the results for the executive \nleadership to support decision-making\n03\nShort-term cash \nflow forecasting\nAccordion delivered a corporate level Cashflow Forecasting model encompassing \nseveral subsidiaries, accounting for disparate data structures and unique cashflow \ncharacteristics. \nModel facilitated CFO office to centrally monitor subsidiary level and corporate \nlevel cashflow performance, with greater confidence in numbers.\n04\nAccount performance \ndashboards\nAccordion partnered with the client team to define several new metrics to measure \nAccount level performance across all Subsidiaries, Products/Services, Account \nManagers etc. \nMetrics allowed deeper insights into drivers for Account topline growth, Churn Risk, \nCompetitor performance etc. \nClient team is now able to focus on critical aspects of the business and providing the \ncorrect inputs, as all monthly reports and summary views are automatically generated - \nreducing the manual effort by more than 75%. \nNew MOR model acts as a one-stop Diagnostic tool to measure and monitor \nperformance of all departments\n•\nFinancial Modeling\n•\nRobotic Process Automation\n•\nExcel Reporting\n• Budgeting\n• Financial Modeling\n• Visualization\n• Financial Modeling\n• Receivables / Payables analysis\n• Business Analytics (SaaS Industry \nknowledge)\n• Dashboarding & Visualization \n• Robotic Process Automation\nOutput\nImpact\nAreas of value add\n"
    }
]