[
    {
        "page": 1,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "page": 0,
            "total_pages": 5,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114164307+05'30'",
            "modDate": "D:20241114164307+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nBI reporting\n1\nDeveloped an end-to-end business intelligence reporting suite to monitor and \nbenchmark risk metrics against targets and act as a single source of truth for \nvarious functions across the firm such as risk management, operations, sales, and \ncompliance. \nFinancial services company\n"
    },
    {
        "page": 2,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "page": 1,
            "total_pages": 5,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114164307+05'30'",
            "modDate": "D:20241114164307+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nPicture this…\nYou’re looking to help build an end-to-end business intelligence reporting suite that acts as single source of truth for \nvarious functions across the firm such as risk management, operations, sales and compliance. Your business model involves \nfinancing high-risk customers to generate returns and currently, there is no streamlined monitoring and controls leading to \nhigh delinquency and charge-offs rates. \nFinancial services company needs to setup a BI reporting suite\n2\nYour value is enhanced. \n•\nYou can monitor and benchmark risk metrics against targets and respond to systematic and seasonal changes in fundamental \nbusiness drivers.\n•\nYour sales personnel can now monitor and track real-time performance against goals to ensure business growth.\nBI  REPORTING\nKEY RESULT   \nVALUE LEVERS PULLED\n•\nCredit risk analytics \n•\nApproval model risk \nanalytics\n•\nDealer/ Intermediary \nfraud analytics\n•\nCompliance risk \nanalytics\n2\nYou turn to Accordion. \nWe partner with your team to develop a business intelligence reporting suite to monitor and benchmark risk metrics against \ntargets, including:\n1)\nRisk reporting: Deploying automated real-time reports that monitor borrowing balance, delinquency, cash flow progression \nduring payment cycle, customer risk profile and default predictors. \n2) Approval performance: Building real-time dashboards to track cash flow and delinquency progression of customers and \nalerting stakeholders of deviations from benchmarks.\n3) Predictive analytics: Deploying machine learning algorithms to predict terminal return on cash flow patterns; simulating future \nperformance utilizing the Markov process to predict expected charge-offs and delinquency rates.\n4) Dealer fraud analytics: Monitoring fraud indicators at dealer and end-customer level by benchmarking payment and purchase \nbehavior vs. expected values and historical fraud occurrences. \n5) Sales reporting: Creating mobile Tableau dashboards for C-suite and sales representatives to improve lead conversion, \ntracking performance against targets and generate higher funding volume from network.\n6) Compliance reporting: Using NLP and text mining to report real-time compliance rates of contracts; identifying non-compliance \nin underwriting accuracy and statutory requirements. \n"
    },
    {
        "page": 3,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "page": 2,
            "total_pages": 5,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114164307+05'30'",
            "modDate": "D:20241114164307+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nAccordion Value Add \n•\nRisk reporting: Deployed automated real-time reports that monitor borrowing balance, delinquency, cash flow progression during payment cycle, customer \nrisk profile and default predictors. \n•\nApproval performance: Built real-time dashboards to track cash flow and delinquency progression of customers and alert stakeholders of deviations from \nbenchmarks.\n•\nPredictive analytics: Deployed machine learning algorithms to predict terminal return on cash flow patterns; simulated future performance utilizing the \nMarkov Process to predict expected charge-offs and delinquency rates.\n•\nDealer fraud analytics: Monitored fraud indicators at dealer and end-customer level by benchmarking payment and purchase behaviour vs. expected values \nand historical fraud occurrences. \n•\nSales reporting: Created mobile Tableau dashboards for C-suite and sales representatives to improve lead conversion, track performance against targets \nand generate higher funding volume from network.\n•\nCompliance reporting:  Used NLP and text mining to report real-time compliance rates of contracts; identified non-compliance in underwriting accuracy and \nstatutory requirements. \nSituation\n•\nThe client’s business model involves financing high-risk customers to generate returns. The lack of streamlined monitoring and controls led to high \ndelinquency and charge-offs rates.\n•\nPartnered with the client to help build an end-to-end business intelligence reporting suite that acts as single source of truth for various functions across \nthe firm such as risk management, operations, sales and compliance. \nBusiness intelligence for a financial services company\n3\nImpact\n•\nHelped client monitor and benchmark risk metrics against targets and respond to systematic and seasonal changes in fundamental business drivers.\n•\nEnabled sales personnel to monitor and track real-time performance against goals to ensure business growth.\nBI / REPORTING SET-UP\n"
    },
    {
        "page": 4,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "page": 3,
            "total_pages": 5,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114164307+05'30'",
            "modDate": "D:20241114164307+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nCredit risk predictive analytics – Risk and terminal cash flow prediction\n4\nRisk Metric Prediction\nTerminal Cash Flow Prediction\n•\nPredicted expected values and control limits for risk metrics based on \nhistorical performance of credit accounts by their risk bucket.\n•\nPredicted terminal return on funded amounts based on cash flows received in the \ninitial phase of customer tenure and aggregated expected returns to weekly \ntranches.\n•\nUtilized predicted cash flows to i) assess profitability, ii) aid in the budgeting \nprocess, and iii) flag systemic changes in customer base and identify outlier funding \ntranches. \n"
    },
    {
        "page": 5,
        "metadata": {
            "source": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "file_path": "C:\\Users\\ansh_lodhi\\Desktop\\BD_Assistant\\CaseStudies\\Case Study (306).pdf",
            "page": 4,
            "total_pages": 5,
            "format": "PDF 1.7",
            "title": "",
            "author": "Akhila Akula",
            "subject": "",
            "keywords": "",
            "creator": "Microsoft® PowerPoint® for Microsoft 365",
            "producer": "Microsoft® PowerPoint® for Microsoft 365",
            "creationDate": "D:20241114164307+05'30'",
            "modDate": "D:20241114164307+05'30'",
            "trapped": ""
        },
        "content": "© 2024 Accordion     CONFIDENTIAL\nVisualization of credit score distribution, approval rate & amount trends \n5\nPeri\nod \n2\nPerio\nd 1\n•\nMonitored risk profile stability by assessing the distribution of approvals \nby credit scores.\n•\nEvaluated volatility in weekly approval rates and monthly approved \namounts by verticals to check for divergence and monitor seasonality.\n•\nMonitored cash flow progression to evaluate cohorts and DQ progression \nacross tranches.\n•\nIdentified systemic shifts in tranche characteristics caused by changes in \ncash flow progression patterns.\nILLUSTRATIVE\n"
    }
]